<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"c948b5b5a5f5ae8483502169553bd2708d9e1635e0ec72ad989b00f4a6463b59","plan_job_ref":"Job Terraform plan #68 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8409843439","plan_out_hash":"931f324d39d998b2c07dc4f194bd56133235cdfd59ef2cf9413ab131b4979b4c","plan_hash":"a9b86fe7ebbf5e19b3d450c375810e897a41a317eeeb758cd84c5ebac490b6ff","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
api_registry             = "crpoec718rf5704ehe0c"
api_repository           = "api"
deployer_access_key      = (sensitive value)
deployer_secret_key      = (sensitive value)
folder_id                = "b1gs3v5tpo5eo8em8ph4"
function_packages_bucket = "movie-recognizer-function-packages"
github_sha               = "8b345c2c9fcf75d5081459490820b742a963b63d"
```
</details>
<details>
<summary>Plan: 13 to add, 6 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # yandex_serverless_container.test-container will be updated in-place
!~  resource "yandex_serverless_container" "test-container" {
        id                 = "bbanib3f62itfcacbg10"
        name               = "api"
#        (11 unchanged attributes hidden)

!~      image {
!~          environment = {
-               "AWS_ACCESS_KEY_ID"     = "*************************"
-               "AWS_DEFAULT_REGION"    = "ru-central1"
-               "AWS_SECRET_ACCESS_KEY" = (sensitive value)
-               "AWS_SQS_SERVICE_URL"   = "https://message-queue.api.cloud.yandex.net"
-               "PROCESS_VIDEO_QUEUE"   = "https://message-queue.api.cloud.yandex.net/b1gm09ss4ahidr70ovv0/dj600000001ein8f05s2/process-video-handler-queue"
-               "RECEIVE_VIDEO_QUEUE"   = "https://message-queue.api.cloud.yandex.net/b1gm09ss4ahidr70ovv0/dj600000001ein8h05s2/receive-video-handler-queue"
-               "YDB_DATABASE_PATH"     = "/ru-central1/b1gm09ss4ahidr70ovv0/etnbcsaj33i9rmmrpfj8"
-               "YDB_ENDPOINT"          = "grpcs://ydb.serverless.yandexcloud.net:2135"
            } -> (known after apply)
!~          url         = "cr.yandex/crpoec718rf5704ehe0c/api:1ca4f8a6e96788dee6b644c09dd62bb9b4e0419b" -> "cr.yandex/crpoec718rf5704ehe0c/api:8b345c2c9fcf75d5081459490820b742a963b63d"
#            (3 unchanged attributes hidden)
        }

#        (1 unchanged block hidden)
    }

  # yandex_ydb_database_iam_binding.api-editor will be updated in-place
!~  resource "yandex_ydb_database_iam_binding" "api-editor" {
        id          = "etnbcsaj33i9rmmrpfj8/ydb.editor"
!~      members     = [
-           "serviceAccount:aje9i9bub1b9lupgb2ju",
-           "serviceAccount:ajecd77m0gn8g32tuha2",
-           "serviceAccount:ajegb9ql2n2ptcu6cmc8",
        ] -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # yandex_ydb_table.video_frame_recognition will be created
+   resource "yandex_ydb_table" "video_frame_recognition" {
+       attributes             = (known after apply)
+       connection_string      = "grpcs://ydb.serverless.yandexcloud.net:2135/?database=/ru-central1/b1gm09ss4ahidr70ovv0/etnbcsaj33i9rmmrpfj8"
+       id                     = (known after apply)
+       key_bloom_filter       = (known after apply)
+       path                   = "video_frame_recognition"
+       primary_key            = [
+           "id",
        ]
+       read_replicas_settings = (known after apply)

+       column {
+           family   = (known after apply)
+           name     = "id"
+           not_null = true
+           type     = "Utf8"
        }
+       column {
+           family   = (known after apply)
+           name     = "recognized_titles"
+           not_null = true
+           type     = "Json"
        }
+       column {
+           family   = (known after apply)
+           name     = "video_frame_id"
+           not_null = true
+           type     = "Utf8"
        }
    }

  # module.process-video-handler.yandex_function.failure-handler will be updated in-place
!~  resource "yandex_function" "failure-handler" {
!~      environment        = {
-           "AWS_ACCESS_KEY_ID"     = "*************************"
-           "AWS_DEFAULT_REGION"    = "ru-central1"
-           "AWS_S3_SERVICE_URL"    = "https://s3.yandexcloud.net"
-           "AWS_SECRET_ACCESS_KEY" = (sensitive value)
-           "AWS_SQS_SERVICE_URL"   = "https://message-queue.api.cloud.yandex.net"
-           "PROCESS_VIDEO_QUEUE"   = "https://message-queue.api.cloud.yandex.net/b1gm09ss4ahidr70ovv0/dj600000001ein8f05s2/process-video-handler-queue"
-           "RECEIVE_VIDEO_QUEUE"   = "https://message-queue.api.cloud.yandex.net/b1gm09ss4ahidr70ovv0/dj600000001ein8h05s2/receive-video-handler-queue"
-           "S3_BUCKET"             = "movie-recognizer"
-           "YDB_DATABASE_PATH"     = "/ru-central1/b1gm09ss4ahidr70ovv0/etnbcsaj33i9rmmrpfj8"
-           "YDB_ENDPOINT"          = "grpcs://ydb.serverless.yandexcloud.net:2135"
        } -> (known after apply)
        id                 = "d4ec32h345ar5cbq5mqg"
        name               = "process-video-failure-handler"
        tags               = []
!~      user_hash          = "1ca4f8a6e96788dee6b644c09dd62bb9b4e0419b" -> "8b345c2c9fcf75d5081459490820b742a963b63d"
#        (10 unchanged attributes hidden)

!~      package {
!~          object_name = "process-video-handler/1ca4f8a6e96788dee6b644c09dd62bb9b4e0419b.zip" -> "process-video-handler/8b345c2c9fcf75d5081459490820b742a963b63d.zip"
#            (1 unchanged attribute hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.process-video-handler.yandex_function.handler will be updated in-place
!~  resource "yandex_function" "handler" {
!~      environment        = {
-           "AWS_ACCESS_KEY_ID"     = "*************************"
-           "AWS_DEFAULT_REGION"    = "ru-central1"
-           "AWS_S3_SERVICE_URL"    = "https://s3.yandexcloud.net"
-           "AWS_SECRET_ACCESS_KEY" = (sensitive value)
-           "AWS_SQS_SERVICE_URL"   = "https://message-queue.api.cloud.yandex.net"
-           "PROCESS_VIDEO_QUEUE"   = "https://message-queue.api.cloud.yandex.net/b1gm09ss4ahidr70ovv0/dj600000001ein8f05s2/process-video-handler-queue"
-           "RECEIVE_VIDEO_QUEUE"   = "https://message-queue.api.cloud.yandex.net/b1gm09ss4ahidr70ovv0/dj600000001ein8h05s2/receive-video-handler-queue"
-           "S3_BUCKET"             = "movie-recognizer"
-           "YDB_DATABASE_PATH"     = "/ru-central1/b1gm09ss4ahidr70ovv0/etnbcsaj33i9rmmrpfj8"
-           "YDB_ENDPOINT"          = "grpcs://ydb.serverless.yandexcloud.net:2135"
        } -> (known after apply)
        id                 = "d4eq6kfp5oh90af5ccql"
        name               = "process-video-handler"
        tags               = []
!~      user_hash          = "1ca4f8a6e96788dee6b644c09dd62bb9b4e0419b" -> "8b345c2c9fcf75d5081459490820b742a963b63d"
#        (10 unchanged attributes hidden)

!~      package {
!~          object_name = "process-video-handler/1ca4f8a6e96788dee6b644c09dd62bb9b4e0419b.zip" -> "process-video-handler/8b345c2c9fcf75d5081459490820b742a963b63d.zip"
#            (1 unchanged attribute hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.receive-video-handler.yandex_function.failure-handler will be updated in-place
!~  resource "yandex_function" "failure-handler" {
!~      environment        = {
-           "AWS_ACCESS_KEY_ID"     = "*************************"
-           "AWS_DEFAULT_REGION"    = "ru-central1"
-           "AWS_SECRET_ACCESS_KEY" = (sensitive value)
-           "AWS_SQS_SERVICE_URL"   = "https://message-queue.api.cloud.yandex.net"
-           "PROCESS_VIDEO_QUEUE"   = "https://message-queue.api.cloud.yandex.net/b1gm09ss4ahidr70ovv0/dj600000001ein8f05s2/process-video-handler-queue"
-           "RECEIVE_VIDEO_QUEUE"   = "https://message-queue.api.cloud.yandex.net/b1gm09ss4ahidr70ovv0/dj600000001ein8h05s2/receive-video-handler-queue"
-           "YDB_DATABASE_PATH"     = "/ru-central1/b1gm09ss4ahidr70ovv0/etnbcsaj33i9rmmrpfj8"
-           "YDB_ENDPOINT"          = "grpcs://ydb.serverless.yandexcloud.net:2135"
        } -> (known after apply)
        id                 = "d4ecqev4cashvh51e1cc"
        name               = "receive-video-failure-handler"
        tags               = []
!~      user_hash          = "1ca4f8a6e96788dee6b644c09dd62bb9b4e0419b" -> "8b345c2c9fcf75d5081459490820b742a963b63d"
#        (10 unchanged attributes hidden)

!~      package {
!~          object_name = "receive-video-handler/1ca4f8a6e96788dee6b644c09dd62bb9b4e0419b.zip" -> "receive-video-handler/8b345c2c9fcf75d5081459490820b742a963b63d.zip"
#            (1 unchanged attribute hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.receive-video-handler.yandex_function.handler will be updated in-place
!~  resource "yandex_function" "handler" {
!~      environment        = {
-           "AWS_ACCESS_KEY_ID"     = "*************************"
-           "AWS_DEFAULT_REGION"    = "ru-central1"
-           "AWS_SECRET_ACCESS_KEY" = (sensitive value)
-           "AWS_SQS_SERVICE_URL"   = "https://message-queue.api.cloud.yandex.net"
-           "PROCESS_VIDEO_QUEUE"   = "https://message-queue.api.cloud.yandex.net/b1gm09ss4ahidr70ovv0/dj600000001ein8f05s2/process-video-handler-queue"
-           "RECEIVE_VIDEO_QUEUE"   = "https://message-queue.api.cloud.yandex.net/b1gm09ss4ahidr70ovv0/dj600000001ein8h05s2/receive-video-handler-queue"
-           "YDB_DATABASE_PATH"     = "/ru-central1/b1gm09ss4ahidr70ovv0/etnbcsaj33i9rmmrpfj8"
-           "YDB_ENDPOINT"          = "grpcs://ydb.serverless.yandexcloud.net:2135"
        } -> (known after apply)
        id                 = "d4ep3qte0591b8ioldkn"
        name               = "receive-video-handler"
        tags               = []
!~      user_hash          = "1ca4f8a6e96788dee6b644c09dd62bb9b4e0419b" -> "8b345c2c9fcf75d5081459490820b742a963b63d"
#        (10 unchanged attributes hidden)

!~      package {
!~          object_name = "receive-video-handler/1ca4f8a6e96788dee6b644c09dd62bb9b4e0419b.zip" -> "receive-video-handler/8b345c2c9fcf75d5081459490820b742a963b63d.zip"
#            (1 unchanged attribute hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.recognize-frame-handler.yandex_function.failure-handler will be created
+   resource "yandex_function" "failure-handler" {
+       created_at         = (known after apply)
+       entrypoint         = "RecognizeFrameHandler.FailureHandler"
+       environment        = (known after apply)
+       execution_timeout  = "10"
+       folder_id          = (known after apply)
+       id                 = (known after apply)
+       image_size         = (known after apply)
+       loggroup_id        = (known after apply)
+       memory             = 128
+       name               = "recognize-frame-failure-handler"
+       runtime            = "dotnet8"
+       service_account_id = (known after apply)
+       tags               = (known after apply)
+       user_hash          = "8b345c2c9fcf75d5081459490820b742a963b63d"
+       version            = (known after apply)

+       package {
+           bucket_name = "movie-recognizer-function-packages"
+           object_name = "recognize-frame-handler/8b345c2c9fcf75d5081459490820b742a963b63d.zip"
        }
    }

  # module.recognize-frame-handler.yandex_function.handler will be created
+   resource "yandex_function" "handler" {
+       created_at         = (known after apply)
+       entrypoint         = "RecognizeFrameHandler.Handler"
+       environment        = (known after apply)
+       execution_timeout  = "10"
+       folder_id          = (known after apply)
+       id                 = (known after apply)
+       image_size         = (known after apply)
+       loggroup_id        = (known after apply)
+       memory             = 128
+       name               = "recognize-frame-handler"
+       runtime            = "dotnet8"
+       service_account_id = (known after apply)
+       tags               = (known after apply)
+       user_hash          = "8b345c2c9fcf75d5081459490820b742a963b63d"
+       version            = (known after apply)

+       package {
+           bucket_name = "movie-recognizer-function-packages"
+           object_name = "recognize-frame-handler/8b345c2c9fcf75d5081459490820b742a963b63d.zip"
        }
    }

  # module.recognize-frame-handler.yandex_function_trigger.failure-trigger will be created
+   resource "yandex_function_trigger" "failure-trigger" {
+       created_at = (known after apply)
+       folder_id  = (known after apply)
+       id         = (known after apply)
+       name       = "recognize-frame-failure-handler-trigger"

+       function {
+           id                 = (known after apply)
+           service_account_id = (known after apply)
        }

+       message_queue {
+           batch_cutoff       = "0"
+           batch_size         = "1"
+           queue_id           = (known after apply)
+           service_account_id = (known after apply)
        }
    }

  # module.recognize-frame-handler.yandex_function_trigger.trigger will be created
+   resource "yandex_function_trigger" "trigger" {
+       created_at = (known after apply)
+       folder_id  = (known after apply)
+       id         = (known after apply)
+       name       = "recognize-frame-handler-trigger"

+       function {
+           id                 = (known after apply)
+           service_account_id = (known after apply)
        }

+       message_queue {
+           batch_cutoff       = "0"
+           batch_size         = "1"
+           queue_id           = (known after apply)
+           service_account_id = (known after apply)
        }
    }

  # module.recognize-frame-handler.yandex_iam_service_account.sa will be created
+   resource "yandex_iam_service_account" "sa" {
+       created_at = (known after apply)
+       folder_id  = (known after apply)
+       id         = (known after apply)
+       name       = "recognize-frame-handler-sa"
    }

  # module.recognize-frame-handler.yandex_iam_service_account.trigger-sa will be created
+   resource "yandex_iam_service_account" "trigger-sa" {
+       created_at = (known after apply)
+       folder_id  = (known after apply)
+       id         = (known after apply)
+       name       = "recognize-frame-handler-trigger-sa"
    }

  # module.recognize-frame-handler.yandex_iam_service_account_static_access_key.sa-key will be created
+   resource "yandex_iam_service_account_static_access_key" "sa-key" {
+       access_key           = (known after apply)
+       created_at           = (known after apply)
+       encrypted_secret_key = (known after apply)
+       id                   = (known after apply)
+       key_fingerprint      = (known after apply)
+       secret_key           = (sensitive value)
+       service_account_id   = (known after apply)
    }

  # module.recognize-frame-handler.yandex_message_queue.deadletter-queue will be created
+   resource "yandex_message_queue" "deadletter-queue" {
+       access_key                  = (sensitive value)
+       arn                         = (known after apply)
+       content_based_deduplication = false
+       delay_seconds               = 0
+       fifo_queue                  = false
+       id                          = (known after apply)
+       max_message_size            = 262144
+       message_retention_seconds   = 345600
+       name                        = "recognize-frame-handler-deadletter-queue"
+       receive_wait_time_seconds   = 0
+       region_id                   = "***********"
+       secret_key                  = (sensitive value)
+       visibility_timeout_seconds  = 10
    }

  # module.recognize-frame-handler.yandex_message_queue.queue will be created
+   resource "yandex_message_queue" "queue" {
+       access_key                  = (sensitive value)
+       arn                         = (known after apply)
+       content_based_deduplication = false
+       delay_seconds               = 0
+       fifo_queue                  = false
+       id                          = (known after apply)
+       max_message_size            = 262144
+       message_retention_seconds   = 1209600
+       name                        = "recognize-frame-handler-queue"
+       receive_wait_time_seconds   = 0
+       redrive_policy              = (known after apply)
+       region_id                   = "***********"
+       secret_key                  = (sensitive value)
+       visibility_timeout_seconds  = 10
    }

  # module.recognize-frame-handler.yandex_resourcemanager_folder_iam_member.roles["ymq.writer"] will be created
+   resource "yandex_resourcemanager_folder_iam_member" "roles" {
+       folder_id = "********************"
+       id        = (known after apply)
+       member    = (known after apply)
+       role      = "ymq.writer"
    }

  # module.recognize-frame-handler.yandex_resourcemanager_folder_iam_member.trigger-editor will be created
+   resource "yandex_resourcemanager_folder_iam_member" "trigger-editor" {
+       folder_id = "********************"
+       id        = (known after apply)
+       member    = (known after apply)
+       role      = "editor"
    }

  # module.recognize-frame-handler.yandex_resourcemanager_folder_iam_member.trigger-function-invoker will be created
+   resource "yandex_resourcemanager_folder_iam_member" "trigger-function-invoker" {
+       folder_id = "********************"
+       id        = (known after apply)
+       member    = (known after apply)
+       role      = "functions.functionInvoker"
    }

Plan: 13 to add, 6 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform apply #94](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8409874296)